Revit 2027 API
ConnectionInputPoint.Point Property
 3d position of this input point.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ Point { get; set; }
Public Property Point As XYZ
	Get
	Set
public:
property XYZ^ Point {
	XYZ^ get ();
	void set (XYZ^ value);
}
member Point : XYZ with get, set
Property Value
XYZ
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ConnectionInputPoint Class
Autodesk.Revit.DB.Structure Namespace